app/Controllers/JenisUjiController.php

UPDATE `spesimen` SET `nama_spesimen` = 'dadadqas', `harga_spesimen_umum` = '100', `harga_spesimen_mahasiswa` = '1', `satuan` = 'adadads', `status_spesimen` = 'Aktif'
WHERE `spesimen`.`id_spesimen` IN ('2')
---
    public function update()
    {
        $id = $this->request->getPost('id_spesimen');
        $data = [
            'id_spesimen' => $this->request->getPost('id_spesimen'),
            'nama_spesimen' => ($this->request->getPost('nama_spesimen')),
            'harga_spesimen_umum' => $this->request->getPost('harga_spesimen_umum'),
            'harga_spesimen_mahasiswa' => $this->request->getPost('harga_spesimen_mahasiswa'),
            'satuan' => $this->request->getPost('satuan'),
            'status_spesimen' => $this->request->getPost('status_spesimen')
        ];

        $this->model->update($id, $data);